---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfTreads
source: html/f24fadfd-381b-6320-ec28-abde777bc9d6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTotalNumberOfTreads Property

"Total Number of Treads": Total number of treads

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTotalNumberOfTreads { get; }
```